Процедура ВыполнитьТест(ПутьКERF, ПутьКРезультату, Помеченные, Группы, ТолькоПроблемы, МаксКарточек, ИдентификаторТеста) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("testId", ИдентификаторТеста);
	Результат.Вставить("status", "DUMMY");
	Результат.Вставить("errorText", "Runner работает");
	Результат.Вставить("hasError", Ложь);
	Результат.Вставить("cancel", Ложь);
	Результат.Вставить("checkedCards", 0);
	Результат.Вставить("cardsWithProblems", 0);
	Результат.Вставить("foundProblems", 0);
	Результат.Вставить("resultRows", 0);
	Результат.Вставить("rows", Новый Массив);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ПутьКРезультату, "UTF-8");
	ЗаписатьJSON(ЗаписьJSON, Результат);
	ЗаписьJSON.Закрыть();
КонецПроцедуры
